#ifndef CL_UI_H
#define CL_UI_H

#include <iostream>

void firstMenu()
{
  printf("\n");
  printf("\t       DAZ---聊天室\t\n");
  printf("/*******************************************/\n");
  printf("/*  ____             ____ _           _    */\n");
  printf("/* |  _ \'  __ _ ____/ ___| |__   __ _| |_  */\n");
  printf("/* | | | |/ _` |_  / |   | '_ \' / _` | __| */\n");
  printf("/* | |_| | (_| |/ /| |___| | | | (_| | |_  */\n");
  printf("/* |____/ \'__,_/___|\'____|_| |_|\'__,_|\'__| */\n");
  printf("/*                                         */\n");
  printf("/*******************************************/\n");
  printf("\t--------------------------------\n");
  printf("\t1.注册\n");
  printf("\t2.登入\n");
  printf("\t3.修改密码\n");
  printf("\t4.修改昵称\n");
  printf("\t5.找回密码\n");
  printf("\t0.退出\n");
  printf("\t--------------------------------\n");
}

#endif

